#       -----------------------------------------
#   Варианты записи словаря:
# data = {1: 2, 1.1: 2.2, 'Text': 'Text2', True: False}
# data2 = {(1,1): 2, (1.1, 1.1): 2.2, ('Text', 'Text1'): 'Text2', (True, True): False}
#       -----------------------------------------

#       -----------------------------------------
#   Пример словаря со смыслом:
# country = {'code': 'RU', 'name': 'Russia', 'population': (144, 'млн.')}
#       -----------------------------------------

#       -----------------------------------------
#   Функция dict():
# country2 = dict(code='RU', name='Russian', population=(144, 'млн.'))
#       -----------------------------------------

#       -----------------------------------------
#   Вывод словаря через цикл:
# data3 = {2: 3, 2.2: 3.3, 'Text2': 'Text3', True: False}
# for key in data3:
#     print(key)
#       -----------------------------------------

#       -----------------------------------------
#   Функция items():
# data4 = {3: 4, 3.3: 4.4, 'Text3': 'Text4', True: False}
# for key, value in data4.items():
#     print(key, '-', value)
#       -----------------------------------------

#       -----------------------------------------
#   Функции для словаря:
# data5 = {4: 5, 4.4: 5.5, 'Text4': 'Text5', True: False}

# print(data5.get('Text4')) # Даёт возможность получить значение по ключу
# print(data5.clear()) # Даёт возможность очистить кортеж
# data5.pop(4) # Даёт возможность очистить отдельный элемент из кортежа
# data5.popitem() # Даёт возможность очистить последний элемент из кортежа
# print(data5.keys()) # Даёт возможность получить все ключи кортежа
# print(data5.values()) # Даёт возможность получить все значения кортежа
# print(data5.items()) # Даёт возможность получить кортеж поделённый на подгруппы
# data5[4] = 'Text5' # Даёт возможность поменять значение ключа
# print(data5) # Даёт возможность выводить кортеж в консоль
#       -----------------------------------------

#       -----------------------------------------
#   Практическая работа (Составить описание 2-ух человека)
# persons = {
#     'user_1': {
#         'first_name': 'John',
#         'last_name': 'Marley',
#         'age': 45,
#         'adress': {
#             'town': 'Moscow',
#             'street': 'Central',
#             'house': '1',
#             'flat': '1',
#         }
#     },
#     'user_2': {
#         'first_name': 'Jim',
#         'last_name': 'Athlon',
#         'age': 50,
#         'adress': {
#             'town': 'Moscow',
#             'street': 'Central',
#             'house': '2',
#             'flat': '2',
#         }
#     }

# }

# print(persons['user_1'])
# print(persons['user_2'])
#       -----------------------------------------