#       -----------------------------------------
#   Варианты записи :
# data = True, 'Text', 1, 1.1
# data = (True, 'Text', 1, 1.1)
#       -----------------------------------------

#       -----------------------------------------
#   Выводить можно при помощи срезов:
# print(data[0:3])
#       -----------------------------------------

#       -----------------------------------------
#   Доступны функции:
# print(data.count(2))
# print(len(data))
#       -----------------------------------------

#       -----------------------------------------
#   Перебор кортежа через цикл:
# for el in data:
#     print(el)
#       -----------------------------------------

#       -----------------------------------------
#   Преобразование списка в кортеж:
# nums = [False, 'Text2', 2, 2.2]
# data2 = tuple(nums)
# print(data2)
#       -----------------------------------------

#       -----------------------------------------
#   Преобразование текста в кортеж:
# world = 'Text'
# data3 = tuple(world)
# print(data3)
#       -----------------------------------------