#       -----------------------------------------
#   Варианты записи
# def func():
#     pass

# func()
#       -----------------------------------------

#       -----------------------------------------
#   Передача параметров:
# def func2(world):
#     print(world)

# func2('Hello!')
#       -----------------------------------------

#       -----------------------------------------
#   Функция сложения:
# def sum(a, b):
#     res = a + b
#     print('Result:', res)

# sum(5, 7)
# sum('H', 'i')
#       -----------------------------------------

#       -----------------------------------------
#       Нахождение минимального значения:
#   Вариант записи через циклы:
# nums1 = [5, 7, 9, 4]
# min = nums1[0]

# for el in nums1:
#     if el < min:
#         min = el

# print(min)
#   Вариант записи через функции:
# nums2 = [5, 7, 9, 4]
# def minimal(l):
#     min2 = l[0]

#     for el in l:
#         if el < min2:
#             min2 = el

#     print(min2)
# minimal(nums2)
#       -----------------------------------------

#       -----------------------------------------
#   Функции lambda:
# func3 = lambda x, y: x * y
# global2 = func3(5, 2)
# print(global2)
#       -----------------------------------------
