#       -----------------------------------------
#   Варианты записи:
# data = set('hello')
# data2 = {5, 7, 6, 7, 4}
#       -----------------------------------------

#       -----------------------------------------
#   Функции множества:
# data3 = set(1, 2.2, 'Text', True)

# data3.add(3.3) # Даёт возможность добавлять один элемент в множество
# data3.update([3.3, 2, 'Text2']) # Даёт возможность добавлять много элементов в множество
# data3.add(3.3) # Даёт возможность удалять один элемент из множества
# data3.pop(3.3) # Даёт возможность удалять первый элемент из множества
# data3.clear() # Даёт возможность полностью очищать всё множество
#       -----------------------------------------

#       -----------------------------------------
#   Удаление повторений из списка:
# nums = [1, 2, 2, 3, 3]
# nums2 = set(nums)
#       -----------------------------------------

#       -----------------------------------------
#   Множества frozenset:
# data4 = frozenset([1, 2, 2, 3, 3])
#       -----------------------------------------
